mod noun;

use crate::Gender;
use crate::NounPrefixRate;
use lazy_static::lazy_static;
pub use noun::*;

pub fn nouns() -> &'static [Noun] {
    lazy_static! {
        static ref NOUNS: Vec<Noun> = vec![
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["пёс", "псы"],
                    ["пса", "псов"],
                    ["псу", "псам"],
                    ["пса", "псов"],
                    ["псом", "псами"],
                    ["псе", "псах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Feminine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["псина", "псины"],
                    ["псины", "псин"],
                    ["псине", "псинам"],
                    ["псину", "псин"],
                    ["псиной", "псинами"],
                    ["псине", "псинах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Feminine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["собака", "собаки"],
                    ["собаки", "собак"],
                    ["собаке", "собакам"],
                    ["собаку", "собак"],
                    ["собакой", "собаками"],
                    ["собаке", "собаках"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Feminine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["шлюха", "шлюхи"],
                    ["шлюхи", "шлюх"],
                    ["шлюхе", "шлюхам"],
                    ["шлюху", "шлюх"],
                    ["шлюхой", "шлюхами"],
                    ["шлюхе", "шлюхах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Feminine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["пизда", "пизды"],
                    ["пизды", "пизд"],
                    ["пизде", "пиздам"],
                    ["пизду", "пизды"],
                    ["пиздой", "пиздами"],
                    ["пизде", "пиздах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["выродок", "выродки"],
                    ["выродка", "выродков"],
                    ["выродку", "выродкам"],
                    ["выродка", "выродков"],
                    ["выродком", "выродками"],
                    ["выродке", "выродках"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["клоун", "клоуны"],
                    ["клоуна", "клоунов"],
                    ["клоуну", "клоунам"],
                    ["клоуна", "клоунов"],
                    ["клоуном", "клоунами"],
                    ["клоуне", "клоунах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["дрочер", "дрочеры"],
                    ["дрочера", "дрочеров"],
                    ["дрочеру", "дрочерам"],
                    ["дрочера", "дрочеров"],
                    ["дрочером", "дрочерами"],
                    ["дрочере", "дрочерах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["вейпер", "вейперы"],
                    ["вейпера", "вейперов"],
                    ["вейперу", "вейперам"],
                    ["вейпера", "вейперов"],
                    ["вейпером", "вейперами"],
                    ["вейпере", "вейперах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Neuter,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["уёбище", "уёбища"],
                    ["уёбища", "уёбищ"],
                    ["уёбищу", "уёбищам"],
                    ["уёбище", "уёбища"],
                    ["уёбищем", "уёбищами"],
                    ["уёбище", "уёбищах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["пендос", "пендосы"],
                    ["пендоса", "пендосов"],
                    ["пендосу", "пендосам"],
                    ["пендоса", "пендосов"],
                    ["пендосом", "пендосами"],
                    ["пендосе", "пендосах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["хохол", "хохлы"],
                    ["хохла", "хохлов"],
                    ["хохлу", "хохлам"],
                    ["хохла", "хохлов"],
                    ["хохлом", "хохлами"],
                    ["хохле", "хохлах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Feminine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["чурка", "чурки"],
                    ["чурки", "чурок"],
                    ["чурке", "чуркам"],
                    ["чурку", "чурки"],
                    ["чуркой", "чурками"],
                    ["чурке", "чурках"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Feminine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["блядь", "бляди"],
                    ["бляди", "блядей"],
                    ["бляди", "блядям"],
                    ["блядь", "бляди"],
                    ["блядью", "блядями"],
                    ["бляди", "блядях"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["блядила", "блядилы"],
                    ["блядилы", "блядил"],
                    ["блядиле", "блядилам"],
                    ["блядилу", "блядил"],
                    ["блядилой", "блядилами"],
                    ["блядиле", "блядилах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Feminine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["мразь", "мрази"],
                    ["мрази", "мразей"],
                    ["мрази", "мразям"],
                    ["мразь", "мразей"],
                    ["мразью", "мразями"],
                    ["мрази", "мразях"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["гондон", "гондоны"],
                    ["гондона", "гондонов"],
                    ["гондону", "гондонам"],
                    ["гондона", "гондонов"],
                    ["гондоном", "гондонами"],
                    ["гондоне", "гондонах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["генератор", "генераторы"],
                    ["генератора", "генераторов"],
                    ["генератору", "генераторам"],
                    ["генератор", "генераторы"],
                    ["генератором", "генераторами"],
                    ["генераторе", "генераторах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["гном", "гномы"],
                    ["гнома", "гномов"],
                    ["гному", "гномам"],
                    ["гнома", "гномов"],
                    ["гномом", "гномами"],
                    ["гноме", "гномах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Neuter,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["гномище", "гномища"],
                    ["гномища", "гномищ"],
                    ["гномищу", "гномищам"],
                    ["гномище", "гномища"],
                    ["гномищем", "гномищами"],
                    ["гномище", "гномищах"]
                ]
                .into(),
            },
            Noun {
                gender: Gender::Feminine,
                prefix_rate: NounPrefixRate::Never,
                forms: [
                    ["хуйня", "хуйни"],
                    ["хуйни", "хуйней"],
                    ["хуйне", "хуйням"],
                    ["хуйню", "хуйни"],
                    ["хуйнёй", "хуйнями"],
                    ["хуйне", "хуйнях"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Never,
                forms: [
                    ["кусок спермы", "куски спермы"],
                    ["куска спермы", "кусков спермы"],
                    ["куску спермы", "кускам спермы"],
                    ["кусок спермы", "куски спермы"],
                    ["куском спермы", "кусками спермы"],
                    ["куске спермы", "кусках спермы"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Never,
                forms: [
                    ["кусок спермы в трусах отца", "куски спермы в трусах отца"],
                    ["куска спермы в трусах отца", "кусков спермы в трусах отца"],
                    ["куску спермы в трусах отца", "кускам спермы в трусах отца"],
                    ["кусок спермы в трусах отца", "куски спермы в трусах отца"],
                    ["куском спермы в трусах отца", "кусками спермы в трусах отца"],
                    ["куске спермы в трусах отца", "кусках спермы в трусах отца"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Never,
                forms: [
                    ["кусок засохшей свиной спермы", "куски засохшей свиной спермы"],
                    ["куска засохшей свиной спермы", "кусков засохшей свиной спермы"],
                    ["куску засохшей свиной спермы", "кускам засохшей свиной спермы"],
                    ["кусок засохшей свиной спермы", "куски засохшей свиной спермы"],
                    ["куском засохшей свиной спермы", "кусками засохшей свиной спермы"],
                    ["куске засохшей свиной спермы", "кусках засохшей свиной спермы"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Never,
                forms: [
                    ["кусок щенячьего дерьма", "куски щенячьего дерьма"],
                    ["куска щенячьего дерьма", "кусков щенячьего дерьма"],
                    ["куску щенячьего дерьма", "кускам щенячьего дерьма"],
                    ["кусок щенячьего дерьма", "куски щенячьего дерьма"],
                    ["куском щенячьего дерьма", "кусками щенячьего дерьма"],
                    ["куске щенячьего дерьма", "кусках щенячьего дерьма"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Never,
                forms: [
                    ["сын шлюхи", "сыны шлюхи"],
                    ["сына шлюхи", "сынов шлюхи"],
                    ["сыну шлюхи", "сынам шлюхи"],
                    ["сына шлюхи", "сыновей шлюхи"],
                    ["сыном шлюхи", "сынами шлюхи"],
                    ["сыне шлюхи", "сынах шлюхи"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Never,
                forms: [
                    ["сын бляди", "сыновья бляди"],
                    ["сына бляди", "сыновей бляди"],
                    ["сыну бляди", "сыновьям бляди"],
                    ["сына бляди", "сыновей бляди"],
                    ["сыном бляди", "сыновьями бляди"],
                    ["сыне бляди", "сыновьях бляди"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Never,
                forms: [
                    ["укроп", "укропы"],
                    ["укропа", "укропов"],
                    ["укропу", "укропам"],
                    ["укроп", "укропы"],
                    ["укропом", "укропами"],
                    ["укропе", "укропах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Never,
                forms: [
                    ["фанатик обоссанного раста", "фанатики обоссанного раста"],
                    ["фанатика обоссанного раста", "фанатиков обоссанного раста"],
                    ["фанатику обоссанного раста", "фанатикам обоссанного раста"],
                    ["фанатика обоссанного раста", "фанатиков обоссанного раста"],
                    ["фанатиком обоссанного раста", "фанатиками обоссанного раста"],
                    ["фанатике обоссанного раста", "фанатиках обоссанного раста"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["дрочила", "дрочилы"],
                    ["дрочилы", "дрочил"],
                    ["дрочиле", "дрочилам"],
                    ["дрочилу", "дрочил"],
                    ["дрочилой", "дрочилами"],
                    ["дрочиле", "дрочилах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Neuter,
                prefix_rate: NounPrefixRate::Never,
                forms: [
                    ["чучело", "чучела"],
                    ["чучела", "чучел"],
                    ["чучелу", "чучелам"],
                    ["чучело", "чучел"],
                    ["чучелом", "чучелами"],
                    ["чучеле", "чучелах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Neuter,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["чмо", "чма"],
                    ["чма", "чм"],
                    ["чму", "чмам"],
                    ["чмо", "чм"],
                    ["чмом", "чмами"],
                    ["чме", "чмах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["уебан", "уебаны"],
                    ["уебана", "уебанов"],
                    ["уебану", "уебанам"],
                    ["уебана", "уебанов"],
                    ["уебаном", "уебанами"],
                    ["уебане", "уебанах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Neuter,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["уебанище", "уебанища"],
                    ["уебанища", "уебанищ"],
                    ["уебанищу", "уебанищам"],
                    ["уебанище", "уебанища"],
                    ["уебанищем", "уебанищами"],
                    ["уебанище", "уебанищах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["карась", "караси"],
                    ["карася", "карасей"],
                    ["карасю", "карасям"],
                    ["карася", "карасей"],
                    ["карасём", "карасями"],
                    ["карасе", "карасях"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["пескарь", "пескари"],
                    ["пескаря", "пескарей"],
                    ["пескарю", "пескарям"],
                    ["пескаря", "пескарей"],
                    ["пескарём", "пескарями"],
                    ["пескаре", "пескарях"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["либераха", "либерахи"],
                    ["либерахи", "либерах"],
                    ["либерахе", "либерахам"],
                    ["либераху", "либерах"],
                    ["либерахой", "либерахами"],
                    ["либерахе", "либерахах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["майдановец", "майдановцы"],
                    ["майдановца", "майдановцев"],
                    ["майдановцу", "майдановцам"],
                    ["майдановца", "майдановцев"],
                    ["майдановцем", "майдановцами"],
                    ["майдановце", "майдановцах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Neuter,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["хрючево", "хрючева"],
                    ["хрючева", "хрючев"],
                    ["хрючеву", "хрючевам"],
                    ["хрючево", "хрючева"],
                    ["хрючевом", "хрючевами"],
                    ["хрючеве", "хрючевах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Feminine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["хохлина", "хохлины"],
                    ["хохлины", "хохлин"],
                    ["хохлине", "хохлинам"],
                    ["хохлину", "хохлин"],
                    ["хохлиной", "хохлинами"],
                    ["хохлине", "хохлинах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Never,
                forms: [
                    ["ослан", "осланы"],
                    ["ослана", "осланов"],
                    ["ослану", "осланам"],
                    ["ослана", "осланов"],
                    ["осланом", "осланами"],
                    ["ослане", "осланах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["свин", "свины"],
                    ["свина", "свинов"],
                    ["свину", "свинам"],
                    ["свина", "свинов"],
                    ["свином", "свинами"],
                    ["свине", "свинах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Feminine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["свинота", "свиноты"],
                    ["свиноты", "свинот"],
                    ["свиноте", "свинотам"],
                    ["свиноту", "свиноты"],
                    ["свинотой", "свинотами"],
                    ["свиноте", "свинотах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Feminine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["сука", "суки"],
                    ["суки", "сук"],
                    ["суке", "сукам"],
                    ["суку", "сук"],
                    ["сукой", "суками"],
                    ["суке", "суках"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["хуй", "хуи"],
                    ["хуя", "хуёв"],
                    ["хую", "хуям"],
                    ["хуй", "хуи"],
                    ["хуем", "хуями"],
                    ["хуе", "хуях"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Always,
                forms: [
                    ["пиздок", "пиздки"],
                    ["пиздка", "пиздков"],
                    ["пиздку", "пиздкам"],
                    ["пиздка", "пиздков"],
                    ["пиздком", "пиздками"],
                    ["пиздке", "пиздках"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Always,
                forms: [
                    ["плёт", "плёты"],
                    ["плёта", "плётов"],
                    ["плёту", "плётам"],
                    ["плёта", "плётов"],
                    ["плётом", "плётами"],
                    ["плёте", "плётах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Always,
                forms: [
                    ["вяз", "вязы"],
                    ["вяза", "вязов"],
                    ["вязу", "вязам"],
                    ["вяз", "вязы"],
                    ["вязом", "вязами"],
                    ["вязе", "вязах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Always,
                forms: [
                    ["сос", "сосы"],
                    ["соса", "сосов"],
                    ["сосу", "сосам"],
                    ["соса", "сосов"],
                    ["сосом", "сосами"],
                    ["сосе", "сосах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Always,
                forms: [
                    ["лёт", "лёты"],
                    ["лёта", "лётов"],
                    ["лёту", "лётам"],
                    ["лёт", "лёты"],
                    ["лётом", "лётами"],
                    ["лёте", "лётах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Always,
                forms: [
                    ["ёб", "ёбы"],
                    ["ёба", "ёбов"],
                    ["ёбу", "ёбам"],
                    ["ёб", "ёбы"],
                    ["ёбом", "ёбами"],
                    ["ёбе", "ёбах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Always,
                forms: [
                    ["глот", "глоты"],
                    ["глота", "глотов"],
                    ["глоту", "глотам"],
                    ["глота", "глотов"],
                    ["глотом", "глотами"],
                    ["глоте", "глотах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Always,
                forms: [
                    ["ед", "еды"],
                    ["еда", "едов"],
                    ["еду", "едам"],
                    ["еда", "едов"],
                    ["едом", "едами"],
                    ["еде", "едах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Always,
                forms: [
                    ["кодер", "кодеры"],
                    ["кодера", "кодеров"],
                    ["кодеру", "кодерам"],
                    ["кодера", "кодеров"],
                    ["кодером", "кодерами"],
                    ["кодере", "кодерах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Always,
                forms: [
                    ["мёт", "мёты"],
                    ["мёта", "мётов"],
                    ["мёту", "мётам"],
                    ["мёт", "мёты"],
                    ["мётом", "мётами"],
                    ["мёте", "мётах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Always,
                forms: [
                    ["жуй", "жуи"],
                    ["жуя", "жуев"],
                    ["жую", "жуям"],
                    ["жуя", "жуев"],
                    ["жуем", "жуями"],
                    ["жуе", "жуях"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Always,
                forms: [
                    ["лиз", "лизы"],
                    ["лиза", "лизов"],
                    ["лизу", "лизам"],
                    ["лиза", "лизов"],
                    ["лизом", "лизами"],
                    ["лизе", "лизах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Always,
                forms: [
                    ["крут", "круты"],
                    ["крута", "крутов"],
                    ["круту", "крутам"],
                    ["крут", "круты"],
                    ["крутом", "крутами"],
                    ["круте", "крутах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Never,
                forms: [
                    ["сала шмат", "сала шматы"],
                    ["сала шмата", "сала шматов"],
                    ["сала шмату", "сала шматам"],
                    ["сала шмат", "сала шматы"],
                    ["сала шматом", "сала шматами"],
                    ["сала шмате", "сала шматах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["пидор", "пидоры"],
                    ["пидора", "пидоров"],
                    ["пидору", "пидорам"],
                    ["пидора", "пидоров"],
                    ["пидором", "пидорами"],
                    ["пидоре", "пидорах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Never,
                forms: [
                    ["грязный мусороприёмник", "грязные мусороприёмники"],
                    ["грязного мусороприёмника", "грязных мусороприёмников"],
                    ["грязному мусороприёмнику", "грязным мусороприёмникам"],
                    ["грязный мусороприёмник", "грязные мусороприёмники"],
                    ["грязным мусороприёмником", "грязными мусороприёмниками"],
                    ["грязном мусороприёмнике", "грязных мусороприёмниках"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["бахмутовец", "бахмутовцы"],
                    ["бахмутовца", "бахмутовцев"],
                    ["бахмутовцу", "бахмутовцам"],
                    ["бахмутовца", "бахмутовцев"],
                    ["бахмутовцем", "бахмутовцами"],
                    ["бахмутовце", "бахмутовцах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["жид", "жиды"],
                    ["жида", "жидов"],
                    ["жиду", "жидам"],
                    ["жида", "жидов"],
                    ["жидом", "жидами"],
                    ["жиде", "жидах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Feminine,
                prefix_rate: NounPrefixRate::Always,
                forms: [
                    ["сосина", "сосины"],
                    ["сосины", "сосин"],
                    ["сосине", "сосинам"],
                    ["сосину", "сосины"],
                    ["сосиной", "сосинами"],
                    ["сосине", "сосинах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Never,
                forms: [
                    ["замкадыш", "замкадыши"],
                    ["замкадыша", "замкадышей"],
                    ["замкадышу", "замкадышам"],
                    ["замкадыша", "замкадышей"],
                    ["замкадышом", "замкадышами"],
                    ["замкадыше", "замкадышах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Never,
                forms: [
                    ["дождевой червь", "дождевые черви"],
                    ["дождевого червя", "дождевых червей"],
                    ["дождевому червю", "дождевым червям"],
                    ["дождевого червя", "дождевых червей"],
                    ["дождевым червем", "дождевыми червями"],
                    ["дождевом черве", "дождевых червях"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Feminine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["щука", "щуки"],
                    ["щуки", "щук"],
                    ["щуке", "щукам"],
                    ["щуку", "щук"],
                    ["щукой", "щуками"],
                    ["щуке", "щуках"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Neuter,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["говно", "говно"],
                    ["говна", "говна"],
                    ["говну", "говну"],
                    ["говно", "говно"],
                    ["говном", "говном"],
                    ["говне", "говне"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["ебалай", "ебалаи"],
                    ["ебалая", "ебалаев"],
                    ["ебалаю", "ебалаям"],
                    ["ебалая", "ебалаев"],
                    ["ебалаем", "ебалаями"],
                    ["ебалае", "ебалаях"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Feminine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["шалава", "шалавы"],
                    ["шалавы", "шалав"],
                    ["шалаве", "шалавам"],
                    ["шалаву", "шалав"],
                    ["шалавой", "шалавами"],
                    ["шалаве", "шалавах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["кусок ноги донецкого мобика", "куски ног донецких мобиков"],
                    ["куска ноги донецкого мобика", "кусков ног донецких мобиков"],
                    ["куску ноги донецкого мобика", "кускам ног донецких мобиков"],
                    ["кусок ноги донецкого мобика", "куски ног донецких мобиков"],
                    ["куском ноги донецкого мобика", "кусками ног донецких мобиков"],
                    ["куске ноги донецкого мобика", "кусках ног донецких мобиков"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Never,
                forms: [
                    ["антихрист", "антихристы"],
                    ["антихриста", "антихристов"],
                    ["антихристу", "антихристам"],
                    ["антихриста", "антихристов"],
                    ["антихристом", "антихристами"],
                    ["антихристе", "антихристах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["сын шалавы", "сыны шалавы"],
                    ["сына шалавы", "сынов шалавы"],
                    ["сыну шалавы", "сынам шалавы"],
                    ["сына шалавы", "сынов шалавы"],
                    ["сыном шалавы", "сынами шалавы"],
                    ["сыне шалавы", "сынах шалавы"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Neuter,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["хрючево", "хрючева"],
                    ["хрючева", "хрючев"],
                    ["хрючеву", "хрючевам"],
                    ["хрючево", "хрючева"],
                    ["хрючевом", "хрючевами"],
                    ["хрючеве", "хрючевах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["клоун", "клоуны"],
                    ["клоуна", "клоунов"],
                    ["клоуну", "клоунам"],
                    ["клоуна", "клоунов"],
                    ["клоуном", "клоунами"],
                    ["клоуне", "клоунах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Always,
                forms: [
                    ["глот", "глоты"],
                    ["глота", "глотов"],
                    ["глоту", "глотам"],
                    ["глота", "глотов"],
                    ["глотом", "глотами"],
                    ["глоте", "глотах"],
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Never,
                forms: [
                    ["овчарка с анальной пробкой в жопе", "овчарки с анальными пробками в жопе"],
                    ["овчарки с анальной пробкой в жопе", "овчарок с анальными пробками в жопе"],
                    ["овчарке с анальной пробкой в жопе", "овчаркам с анальными пробками в жопе"],
                    ["овчарку с анальной пробкой в жопе", "овчарок с анальными пробками в жопе"],
                    ["овчаркой с анальной пробкой в жопе", "овчарками с анальными пробками в жопе"],
                    ["овчарке с анальной пробкой в жопе", "овчарках с анальными пробками в жопе"]
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Never,
                forms: [
                    [
                        "кусок свиного дерьма смешанного с конской спермой",
                        "куски свиного дерьма смешанного с конской спермой"
                    ],
                    [
                        "куска свиного дерьма смешанного с конской спермой",
                        "кусков свиного дерьма смешанного с конской спермой"
                    ],
                    [
                        "куску свиного дерьма смешанного с конской спермой",
                        "кускам свиного дерьма смешанного с конской спермой"
                    ],
                    [
                        "кусок свиного дерьма смешанного с конской спермой",
                        "куски свиного дерьма смешанного с конской спермой"
                    ],
                    [
                        "куском свиного дерьма смешанного с конской спермой",
                        "кусками свиного дерьма смешанного с конской спермой"
                    ],
                    [
                        "куске свиного дерьма смешанного с конской спермой",
                        "кусках свиного дерьма смешанного с конской спермой"
                    ]
                ]
                .into(),
            },
            Noun {
                gender: Gender::Feminine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["мразь", "мрази"],
                    ["мрази", "мразей"],
                    ["мрази", "мразам"],
                    ["мразь", "мразей"],
                    ["мразью", "мразями"],
                    ["мрази", "мразах"]
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["инвалид", "инвалиды"],
                    ["инвалида", "инвалидов"],
                    ["инвалиду", "инвалидам"],
                    ["инвалида", "инвалидов"],
                    ["инвалидом", "инвалидами"],
                    ["инвалиде", "инвалидах"]
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["холоп", "холопы"],
                    ["холопа", "холопов"],
                    ["холопу", "холопам"],
                    ["холопа", "холопов"],
                    ["холопом", "холопами"],
                    ["холопе", "холопах"]
                ]
                .into(),
            },
            Noun {
                gender: Gender::Masculine,
                prefix_rate: NounPrefixRate::Sometimes,
                forms: [
                    ["гой", "гои"],
                    ["гоев", "гоев"],
                    ["гою", "гоям"],
                    ["гоя", "гоев"],
                    ["гоем", "гоями"],
                    ["гое", "гоях"]
                ]
                .into(),
            },
        ];
    }

    return &NOUNS;
}
