use lazy_static::lazy_static;

pub fn noun_prefixes() -> &'static [&'static str] {
    lazy_static! {
        static ref PREFIXES: Vec<&'static str> = vec![
            "хуе",
            "свино",
            "псино",
            "собако",
            "шлюхо",
            "пиздо",
            "члено",
            "говно",
            "кало",
            "ебло",
            "швайно",
            "зиго",
            "виндо",
            "линуксо",
            "яйце",
            "лице",
            "хохло",
            "чурко",
            "негро",
            "лисо",
            "фурри",
            "пони",
            "спермо",
            "евро",
            "шизо",
            "полу",
            "асмр",
            "бляде",
            "недо",
            "конче",
        ];
    }

    return &PREFIXES;
}
